var extGeo = {
	"鼓楼区":["鼓东","鼓西","温泉","东街","南街","津泰","华大","水部","五凤","宝龙","安泰","五一广场","乌山路","五一北路","六一北路","白马北路","八一七北路","黎明","西湖","西江滨","西二环","杨桥路","五四路","铜盘路","华林路","湖前","省体中心","鼓楼周边","左海","大儒世家","北二环","温泉公园","凤湖路","软件大道","洪甘路","梅亭","梅峰路","仙塔街","福新路","古田路","福飞南路","中环","东大路","湖滨路","鼓屏","乌山西路","洪山桥头","西洪路"]
	,"台江区":["瀛洲","后洲","义洲","新港","上海","苍霞","茶亭","洋中","鳌峰","宁化","中州岛","中亭街","元洪城","江滨中路","工业路","宝龙广场","六一中路","五一南路","白马南路","西二环南路","排尾路","八一七南路","台江路","武夷绿洲","省人民医院","台江周边","帮洲街","双杭","国货西路","闽江世纪广场","博美诗邦","大利嘉城"]
	,"仓山区":["仓前","东升","对湖","临江","三叉街","上渡","下渡","金山大道","闽江大道","南江滨路","洪湾路","浦上大道","连江南路","上三路","六一南路","建新路","火车南站","三高路","榕城广场","南二环路","则徐大道","白湖亭","下三路","万达","金桔路","金祥路","福峡路","仓山周边","江南水都","中庚城","学生街","福湾路","盘屿路"]
	,"晋安区":["茶园","王庄","象园","岳峰","鼓山","新店","福马路","东二环","新东区","远洋路","连江路","前横路","福新中路","塔头","茶会","火车站","五四北","五里亭","晋安周边","西园","鹤林新城","钱隆御景"]
	,"马尾区":["罗星","江滨东大道","君竹路","儒江","亭江","琅岐","马尾周边"]
	,"闽侯县":["大学城","上街","乌龙江大道","青口","甘蔗","南屿"]
	,"长乐市":["吴航","金峰","漳港"]
	,"福清市":["龙田","玉屏","龙山","龙江","音西","宏路","石竹","阳下","三山","渔溪","高山","海口","城头","江阴","东张"]
	,"平潭县":["深溪底路","翠苑南路","万宝路","小商品市场","龙凤路","西航路","环岛","汽车站"]
	,"连江县":["贵安","县城"]
}